БухЭксп/Catalogs/CW_Пункты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Пункты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Пункты/Ext/ManagerModule.bsl
Функция ВыполнитьКонвертациюАдресов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_Пункты.Ссылка КАК Ссылка,
	|	CW_Пункты.Адрес КАК Адрес
	|ИЗ
	|	Справочник.CW_Пункты КАК CW_Пункты
	|ГДЕ
	|	CW_Пункты.ПометкаУдаления = ЛОЖЬ";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		
		Если ПустаяСтрока(Выборка.Адрес) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеАдреса = РаботаСАдресами.РазложитьПредставлениеАдресаПоПолям(Выборка.Адрес);
		
		КонтактнаяИнформацияАдреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(
			ДанныеАдреса,
			Выборка.Адрес,
			ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
		
		СтруктураПараметров = Новый Структура("БезПредставлений, ПроверитьАдрес, КодыАдреса", Ложь, Истина, Истина);
		СтруктураАдреса = РаботаСАдресами.СведенияОбАдресе(КонтактнаяИнформацияАдреса, СтруктураПараметров);
		
		ПунктОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПунктОбъект.Адрес 					= СтруктураАдреса.Представление;
		ПунктОбъект.КонтактнаяИнформация 	= КонтактнаяИнформацияАдреса;
		ПунктОбъект.Записать();
		
	КонецЦикла;
	
КонецФункции
